ЖКХ/src/Documents/ВыставленныеСчета/ВыставленныеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыставленныеСчета</name>
  <comment>Счета за коммунальные услуги</comment>
  <registerRecords>AccumulationRegister.ПотреблениеРесурсов</registerRecords>
  <registerRecords>InformationRegister.Тарифы</registerRecords>
  <registerRecords>AccumulationRegister.Начисления</registerRecords>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.ЛицевыеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недвижимость</name>
    <type>
      <types>CatalogRef.ОбъектыНедвижимости</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перерасчеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Задолженность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Льготы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖКХ/src/AccumulationRegisters/ПотреблениеРесурсов/ПотреблениеРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотреблениеРесурсов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПотреблениеРесурса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПриборУчета</name>
    <type>
      <types>CatalogRef.ПриборыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>EnumRef.ИсточникиПотребления</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЖКХ/src/AccumulationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Начисления</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.ЛицевыеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЖКХ/src/InformationRegisters/Тарифы/Тарифы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Тарифы</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РесурсУслуга</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖКХ/src/Enums/ИсточникиПотребления/ИсточникиПотребления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиПотребления</name>
  <enumValues>
    <name>ПоказанияПриборов</name>
  </enumValues>
  <enumValues>
    <name>ВыставленныеСчета</name>
  </enumValues>
</mdclass:Enum>

ЖКХ/src/Documents/ВыставленныеСчета/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ЗаполняемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияЖКХКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не заполнен лицевой счет.'"), "ЛицевойСчет");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛицевойСчет) И ЗначениеЗаполнено(Недвижимость) Тогда
		
		Если ПотреблениеЖКХ.ОбъектНедвижимостиЛицевогоСчета(ЛицевойСчет) <> Недвижимость Тогда
			Отказ = Истина;
			ОбщегоНазначенияЖКХКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Недвижимость не соответствует лицевому счету.'"), "Недвижимость");
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверенныеУслуги = Новый Соответствие;
	Для Каждого СтрокаУслуги Из Услуги Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаУслуги.Услуга) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПроверенныеУслуги[СтрокаУслуги.Услуга] <> Неопределено Тогда
			
			Отказ = Истина;
			ОбщегоНазначенияЖКХКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Услуга указана в документе более одного раза.'"),
				"Услуги[" + (СтрокаУслуги.НомерСтроки - 1) + "].Услуга");
			
		Иначе
			
			ПроверенныеУслуги.Вставить(СтрокаУслуги.Услуга, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ПотреблениеРесурсов.Записывать = Истина;
	Движения.Начисления.Записывать = Истина;
	// Движения по регистру Тарифы очищаются платформой при повторном проведении
	// и при отмене проведения документа: регистр подчинен регистратору.
	Движения.Тарифы.Записывать = Истина;
	
	ПриборыУслуг = ПотреблениеЖКХ.ПриборыУчетаПоУслугам(ЛицевойСчет);
	
	Для Каждого СтрокаУслуги Из Услуги Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаУслуги.Услуга) Тогда
			Продолжить;
		КонецЕсли;
		
		// Регистр Показания не заполняется: в файле нет показаний приборов учета.
		ПриборУчета = ПриборыУслуг.Получить(СтрокаУслуги.Услуга);
		
		Движение = Движения.ПотреблениеРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.Источник = Перечисления.ИсточникиПотребления.ВыставленныеСчета;
		Движение.ПриборУчета = ?(ЗначениеЗаполнено(ПриборУчета), ПриборУчета, Справочники.ПриборыУчета.ПустаяСсылка());
		Движение.Ресурс = СтрокаУслуги.Услуга;
		Движение.ПотреблениеРесурса = СтрокаУслуги.Объем;
		
		// регистр Начисления
		ДвижениеНачисления = Движения.Начисления.Добавить();
		ДвижениеНачисления.Период = Дата;
		ДвижениеНачисления.ЛицевойСчет = ЛицевойСчет;
		ДвижениеНачисления.Услуга = СтрокаУслуги.Услуга;
		ДвижениеНачисления.Сумма = СтрокаУслуги.Начислено;
		
	КонецЦикла;
	
	ЗаполнитьДвиженияТарифов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет движения регистра "Тарифы" тарифами услуг документа.
//
// Движение по услуге формируется, только если тариф отличается от тарифа, действовавшего
// до периода документа. При нулевом или неизменном тарифе движение не создается: регистр
// подчинен регистратору, поэтому отсутствие движения означает отсутствие записи за период.
//
Процедура ЗаполнитьДвиженияТарифов()
	
	ПериодТарифа = НачалоМесяца(Дата);
	
	ТарифыУслуг = Новый Соответствие;
	Для Каждого СтрокаУслуги Из Услуги Цикл
		Если ЗначениеЗаполнено(СтрокаУслуги.Услуга) Тогда
			ТарифыУслуг.Вставить(СтрокаУслуги.Услуга, СтрокаУслуги.Тариф);
		КонецЕсли;
	КонецЦикла;
	
	Если ТарифыУслуг.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокУслуг = Новый Массив;
	Для Каждого КлючИЗначение Из ТарифыУслуг Цикл
		СписокУслуг.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	// Записи периода документа не учитываются: сравниваем с тарифом, действовавшим ранее.
	ДействующиеТарифы = ТарифыЖКХ.ТарифыНаДату(СписокУслуг, ПериодТарифа - 1);
	
	Для Каждого КлючИЗначение Из ТарифыУслуг Цикл
		
		РесурсУслуга = КлючИЗначение.Ключ;
		Тариф = КлючИЗначение.Значение;
		
		Если Тариф = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДействующийТариф = ДействующиеТарифы.Получить(РесурсУслуга);
		Если ДействующийТариф <> Неопределено И ДействующийТариф = Тариф Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = Движения.Тарифы.Добавить();
		Запись.Период = ПериодТарифа;
		Запись.РесурсУслуга = РесурсУслуга;
		Запись.Тариф = Тариф;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
